Keule/ZAI_GPS/ag-steer/src/hal_esp32/hal_impl.cpp
    if (miso_when_mosi_low != miso_when_mosi_high) {
        hal_log("ESP32: WARNING – crosstalk detected between MOSI and MISO!");
        hal_log("ESP32:   This means MOSI/DIN and MISO/DOUT cables are SWAPPED.");
        hal_log("ESP32:   Correct wiring: ADS1118 DOUT -> ESP32 MISO (GPIO%d)", SENS_SPI_MISO);
        hal_log("ESP32:                  ADS1118 DIN  -> ESP32 MOSI (GPIO%d)", SENS_SPI_MOSI);
    } else if (miso_raw == 1) {
        hal_log("ESP32: MISO (GPIO%d) reads HIGH = floating / no device driving it", SENS_SPI_MISO);
        hal_log("ESP32:   Check: Is DOUT connected to GPIO%d?", SENS_SPI_MISO);
    }

    // === END GPIO DIAGNOSTIC ===
}

bool hal_steer_angle_detect(void) {
    // Do NOT rely on any previous conversion.
    // Full 3-step cycle: config → wait → read

    // Step 1: send config, start conversion (ignore garbage result)
    ads1118Transaction();

    // Step 2: wait for conversion to complete
    hal_delay_ms(ADS1118_CONV_MS + 2);

    // Step 3: read conversion result
    int16_t raw = ads1118Transaction();

    // Crosstalk check: if raw value is suspiciously close to our config
    // (0x8383 or 0x0383), MOSI and MISO are likely swapped
    uint16_t uval = static_cast<uint16_t>(raw);
    if ((uval & 0x00FF) == 0x0083) {
        hal_log("ESP32: ADS1118 WARNING – raw 0x%04X looks like crosstalk (config echo)",
                uval);
        hal_log("ESP32:   MOSI and MISO cables are likely SWAPPED!");
        hal_log("ESP32:   Correct: DOUT->GPIO%d(MISO)  DIN->GPIO%d(MOSI)",
                SENS_SPI_MISO, SENS_SPI_MOSI);
    }

    float voltage = static_cast<float>(raw) * ADS1118_LSB_V;

    bool detected = (raw != static_cast<int16_t>(0xFFFF) && raw != 0x0000);

    if (detected) {
        s_ads_last_raw = raw;
    }

    hal_log("ESP32: ADS1118 detect: raw=%d (0x%04X), voltage=%.4fV %s",
            raw, uval, voltage,
            detected ? "OK" : "FAIL");

    return detected;
}

float hal_steer_angle_read_deg(void) {
    // Check if enough time has passed for the conversion to complete
    uint32_t elapsed = millis() - s_ads_last_conv_start;
    if (elapsed >= ADS1118_CONV_MS) {
        // Conversion ready – read result and start next conversion
        int16_t raw = ads1118Transaction();

        // 0xFFFF means conversion not ready or bus error
        if (raw != static_cast<int16_t>(0xFFFF)) {
            s_ads_last_raw = raw;
        }
        // else: keep previous value
    }
    // else: not enough time, return last known value

    int16_t raw = s_ads_last_raw;

    // Convert to voltage
    float voltage = static_cast<float>(raw) * ADS1118_LSB_V;

    // Normalise to 0.0 .. 1.0 (3.3V poti supply)
    float normalised = voltage / 3.3f;

    // Clamp
    if (normalised < 0.0f) normalised = 0.0f;
    if (normalised > 1.0f) normalised = 1.0f;

    // Map 0..1 → -45°..+45°
    float angle = (normalised * 90.0f) - 45.0f;

    return angle;
}

void hal_actuator_begin(void) {
    pinMode(CS_ACT, OUTPUT);
    digitalWrite(CS_ACT, HIGH);
    hal_log("ESP32: Actuator begun on CS=%d (stub)", CS_ACT);
}

bool hal_actuator_detect(void) {
    // Actuator is write-only, hard to verify by reading back.
    // Just verify the SPI bus works by attempting a transfer.
    sensorSPI.beginTransaction(SPISettings(1000000, MSBFIRST, SPI_MODE0));
    digitalWrite(CS_ACT, LOW);
    uint8_t response = sensorSPI.transfer(0x00);
    digitalWrite(CS_ACT, HIGH);
    sensorSPI.endTransaction();

    bool detected = true;  // Stub: assume OK (actuator is write-only)
    hal_log("ESP32: Actuator detect: SPI %s", detected ? "OK" : "FAIL");
    return detected;
}

void hal_actuator_write(uint16_t cmd) {
    sensorSPI.beginTransaction(SPISettings(1000000, MSBFIRST, SPI_MODE0));
    digitalWrite(CS_ACT, LOW);
    sensorSPI.transfer(static_cast<uint8_t>((cmd >> 8) & 0xFF));
    sensorSPI.transfer(static_cast<uint8_t>(cmd & 0xFF));
    digitalWrite(CS_ACT, HIGH);
    sensorSPI.endTransaction();
}

// ===================================================================
// Network – W5500 Ethernet via ESP-IDF ETH driver
//
// Uses ETH.begin() to initialise the W5500 on SPI3_HOST with the
// pins defined by the LilyGO board design.  The ETH driver handles
// SPI communication internally – no manual SPI setup needed.
//
// Link status and IP assignment are tracked via WiFi.onEvent()
// callbacks (ARDUINO_EVENT_ETH_CONNECTED / ARDUINO_EVENT_ETH_GOT_IP).
// ===================================================================

/// WiFi event handler for Ethernet events
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
static void onEthEvent(WiFiEvent_t event, arduino_event_info_t info) {
#else
// Arduino 2.x uses older event signature
static void onEthEvent(WiFiEvent_t event) {
#endif
    switch (event) {
    case ARDUINO_EVENT_ETH_START:
        hal_log("ETH: driver started");
        ETH.setHostname("agsteer");
        break;

    case ARDUINO_EVENT_ETH_CONNECTED:
        hal_log("ETH: link UP (%s %u Mbps)",
                ETH.fullDuplex() ? "full-duplex" : "half-duplex",
                ETH.linkSpeed());
        s_eth_link_up = true;
        break;

    case ARDUINO_EVENT_ETH_GOT_IP:
        hal_log("ETH: got IP %s  (MAC: %s)",
                ETH.localIP().toString().c_str(),
                ETH.macAddress().c_str());
        s_eth_has_ip = true;
        // Start UDP listener on AgIO port
        ethUDP.begin(AOG_PORT_AGIO);
        hal_log("ETH: UDP listening on port %u", AOG_PORT_AGIO);
        break;

    case ARDUINO_EVENT_ETH_DISCONNECTED:
        hal_log("ETH: link DOWN");
        s_eth_link_up = false;
        s_eth_has_ip = false;
        ethUDP.stop();
        break;

    case ARDUINO_EVENT_ETH_STOP:
        hal_log("ETH: driver stopped");
        s_eth_link_up = false;
        s_eth_has_ip = false;
        break;

    default:
        break;
    }
}

void hal_net_init(void) {
    // Register Ethernet event handler
    WiFi.onEvent(onEthEvent);

    hal_log("ETH: initialising W5500 on SPI3_HOST (SCK=%d MISO=%d MOSI=%d CS=%d INT=%d RST=%d)...",
            ETH_SCK, ETH_MISO, ETH_MOSI, ETH_CS, ETH_INT, ETH_RST);

    // Initialise W5500 via ESP-IDF ETH driver
    // Parameters: phy_type, phy_addr, cs, irq, rst, spi_host, sck, miso, mosi
    bool init_ok = ETH.begin(
        ETH_PHY_W5500,   // PHY type
        1,                // PHY address (must be 1 for this board)
        ETH_CS,           // Chip Select    = GPIO 9
        ETH_INT,          // Interrupt      = GPIO 13
        ETH_RST,          // Reset          = GPIO 14
        SPI3_HOST,        // SPI peripheral (FSPI on ESP32-S3)
        ETH_SCK,          // SPI Clock      = GPIO 10
        ETH_MISO,         // SPI MISO       = GPIO 11
        ETH_MOSI          // SPI MOSI       = GPIO 12
    );

    if (!init_ok) {
        hal_log("ETH: FAILED – W5500 not detected! Check SPI connections.");
        s_w5500_detected = false;
        return;
    }

